#+TITLE: Monolith in Python
#+startup: showeverything

*** TODO Literate programming reading of the example from the book
    CLOCK: [2014-10-09 木 14:38]
    CLOCK: [2014-10-09 木 13:50]--[2014-10-09 木 13:55] =>  0:05

# Note: A bit delicate to do literate programming in python
# due to messing up indentations during tangling step.

#+BEGIN_SRC python :tangle src/prog-styles/monolith-in-python/run.py :mkdirp true
import sys, string, os

src_root		= "src/exercises-in-programming-style/"
pride_and_prejudice	= os.path.join(src_root, "pride-and-prejudice.txt")
stop_words		= os.path.join(src_root, "stop_words.txt")

# the global list of [word, frequency] pairs
word_freqs = []
# the list of stop words
with open(stop_words) as f:
    stop_words = f.read().split(',')
stop_words.extend(list(string.ascii_lowercase))

# iterate through the file one line 
for line in open(pride_and_prejudice):
    start_char = None
    i = 0
    for c in line:
        if start_char == None:
            if c.isalnum():
                # We found the start of a word
                start_char = i
        else:
            if not c.isalnum():
                # We found the end of a word. Process it
                found = False
                word = line[start_char:i].lower()
                # Ignore stop words
                if word not in stop_words:
                    pair_index = 0
                    # Let's see if it already exists
                    for pair in word_freqs:
                        if word == pair[0]:
                            pair[1] += 1
                            found = True
                            found_at = pair_index
                            break
                        pair_index += 1
                    if not found:
                        word_freqs.append([word, 1])
                    elif len(word_freqs) > 1:
                        # We may need to reorder
                        for n in reversed(range(pair_index)):
                            if word_freqs[pair_index][1] > word_freqs[n][1]:
                                # swap
                                word_freqs[n], word_freqs[pair_index] = word_freqs[pair_index], word_freqs[n]
                                pair_index = n
                # Let's reset
                start_char = None
        i += 1

for tf in word_freqs[0:25]:
    print tf[0], ' - ', tf[1]
#+END_SRC

*** TODO Running the program

Match whether the implementation matches the expected results.
Note that we need to run this from the root of the repo.

#+name: monolith-in-python
#+BEGIN_SRC sh :results output
python src/prog-styles/monolith-in-python/run.py
#+END_SRC

#+RESULTS: monolith-in-python
#+include: "org/prog-styles/results.org"
